tests/jmeter/my-api-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="My API Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"/>
      <stringProp name="TestPlan.serialize_threadgroups">false</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/v1/profiles" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">server</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/profiles</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
<!--         <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/v1/reviews" enabled="true"> -->
<!--           <elementProp name="HTTPsampler.Arguments" elementType="Arguments"> -->
<!--             <collectionProp name="Arguments.arguments"/> -->
<!--           </elementProp> -->
<!--           <stringProp name="HTTPSampler.domain">server</stringProp> -->
<!--           <stringProp name="HTTPSampler.port">80</stringProp> -->
<!--           <stringProp name="HTTPSampler.protocol">http</stringProp> -->
<!--           <stringProp name="HTTPSampler.path">/api/v1/reviews</stringProp> -->
<!--           <stringProp name="HTTPSampler.method">GET</stringProp> -->
<!--           <boolProp name="HTTPSampler.follow_redirects">true</boolProp> -->
<!--           <boolProp name="HTTPSampler.auto_redirects">false</boolProp> -->
<!--           <boolProp name="HTTPSampler.use_keepalive">true</boolProp> -->
<!--           <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp> -->
<!--           <stringProp name="HTTPSampler.embedded_url_re"></stringProp> -->
<!--         </HTTPSamplerProxy> -->
<!--         <hashTree/> -->

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>